app/views/voters/index.html.erb

SELECT "candidates".* FROM "candidates" WHERE "candidates"."voter_id" = 1 LIMIT 1
SELECT "votes".* FROM "votes" WHERE "votes"."voter_id" = 1 LIMIT 1
---

      <% total_for_candidate = @votes.select { |v| v.candidate == candidate } %>
      <% leader = candidate if candidate.votes.length > leader.votes.length %>