app/views/voters/welcome.erb

SELECT "votes".* FROM "votes" WHERE "votes"."voter_id" = 1 LIMIT 1
---
  <% @candidates.each do |candidate| %>
      <% leader = candidate if candidate.votes.length > leader.votes.length %>