app/controllers/candidates_controller.rb

SELECT "candidates".* FROM "candidates"
---
  def index
    @candidates = Candidate.all

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @candidate = Candidate.find(params[:id])

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @candidate = Candidate.find(params[:id])

INSERT INTO "candidates" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 24 Jun 2012 13:50:28 UTC +00:00], ["name", "Mr. Bush"], ["updated_at", Sun, 24 Jun 2012 13:50:28 UTC +00:00]]
---
  def create
    @candidate = Candidate.new(params[:candidate])

    respond_to do |format|
      if @candidate.save

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "candidates" SET "name" = 'Mr. Wells', "updated_at" = '2012-06-27 19:43:03.927897' WHERE "candidates"."id" = 1
---
  def update
    @candidate = Candidate.find(params[:id])

    respond_to do |format|
      if @candidate.update_attributes(params[:candidate])

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 2]]
---
  def destroy
    @candidate = Candidate.find(params[:id])
    @candidate.destroy