app/controllers/voters_controller.rb

SELECT "voters".* FROM "voters" WHERE "voters"."vote" = 2
SELECT "candidates".* FROM "candidates" WHERE "candidates"."voter_id" = 1 LIMIT 1
SELECT "votes".* FROM "votes" WHERE "votes"."voter_id" = 1 LIMIT 1
---
  def index
    @voters = Voter.all
    @candidates = Candidate.all
    @votes = Vote.all

SELECT "voters".* FROM "voters" WHERE "voters"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @voter = Voter.find(params[:id])

SELECT "candidates".* FROM "candidates"
---
  def new
    @voter = Voter.new
    @candidates = Candidate.all

SELECT "voters".* FROM "voters" WHERE "voters"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @voter = Voter.find(params[:id])

INSERT INTO "voters" ("created_at", "name", "updated_at", "vote") VALUES (?, ?, ?, ?)  [["created_at", Sat, 23 Jun 2012 15:04:14 UTC +00:00], ["name", "Jack"], ["updated_at", Sat, 23 Jun 2012 15:04:14 UTC +00:00], ["vote", 1]]
---
  def create
    puts "in Voters controller"
    @voter = Voter.new(params[:voter])


    respond_to do |format|
      if @voter.save

SELECT "voters".* FROM "voters" WHERE "voters"."id" = ? LIMIT 1  [["id", "2"]]
---
  def update
    @voter = Voter.find(params[:id])

SELECT "voters".* FROM "voters" WHERE "voters"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "voters" WHERE "voters"."id" = ?  [["id", 2]]
---
  def destroy
    @voter = Voter.find(params[:id])
    @voter.destroy

SELECT "voters".* FROM "voters"
SELECT "candidates".* FROM "candidates"
---
  def cast_ballot
    @voters = Voter.all
    @candidates = Candidate.all

SELECT "candidates".* FROM "candidates"
SELECT "votes".* FROM "votes" WHERE "votes"."voter_id" = 1 LIMIT 1
---
  def welcome
    @candidates = Candidate.all
    @votes = Vote.all