app/controllers/votes_controller.rb

  def index
    @votes = Vote.all
---
SELECT "votes".* FROM "votes"

  def show
    @vote = Vote.find(params[:id])
---
SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @vote = Vote.new
    @candidates = Candidate.all
---
SELECT "candidates".* FROM "candidates"

  def edit
    @vote = Vote.find(params[:id])
---
SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "4"]]

  def create
    @candidates = Candidate.all
    @vote = Vote.new(params[:vote])



    respond_to do |format|
      if @vote.save
---
SELECT "candidates".* FROM "candidates"
INSERT INTO "votes" ("candidate_id", "created_at", "updated_at", "voter_id") VALUES (?, ?, ?, ?)  [["candidate_id", nil], ["created_at", Tue, 26 Jun 2012 15:18:48 UTC +00:00], ["updated_at", Tue, 26 Jun 2012 15:18:48 UTC +00:00], ["voter_id", nil]]